---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionSigmaProfileWithLips
source: html/6136c656-bb49-d11c-eb21-33e3adf5353e.htm
---
# StructuralSectionSigmaProfileWithLips Members

Creates a new instance of Structural Section Sigma Profile With Lips shape with the associated set of parameters,
 used to attach to structural element.